In [6]:
pip install lat-lon-parser

Requirement already satisfied: lat-lon-parser in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (1.3.1)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import requests
from bs4 import BeautifulSoup
import sqlalchemy
from lat_lon_parser import parse

## 1 Webscrabe from Wiki information for few cities

In [23]:
def cities_dataframe(cities):
  cities_data = []

  for city in cities:
    city_data = {}

    # city
    city_data["City"] = city

    # create the soup
    url = f"https://www.wikipedia.org/wiki/{city}"
    response = requests.get(url)
    city_soup = BeautifulSoup(response.content, 'html.parser')

    # country
    city_data["Country"] = city_soup.find(class_="infobox-data").get_text()

    # population
    city_population = city_soup.find(string="Population").find_next("td").get_text()
    city_population_clean = int(city_population.replace(",", ""))
    city_data["Population"] = city_population_clean

    # data retrieved
    city_data["Year_Data_Retrieved"] = city_soup.find(string="Population").find_next().get_text()[2:6]

    # latitude and longitude
    city_data["Latitude"] = city_soup.find(class_="latitude").get_text()
    city_data["Longitude"] = city_soup.find(class_="longitude").get_text()
    city_data["Latitude"] = parse(city_data["Latitude"])
    city_data["Longitude"] = parse(city_data["Longitude"])

    # append this city's data to the cities list
    cities_data.append(city_data)

  return pd.DataFrame(cities_data)

In [24]:
cities_df = cities_dataframe(["Berlin", "Hamburg", "Munich"])

In [25]:
cities_df

      City  Country  Population Year_Data_Retrieved  Latitude  Longitude
0   Berlin  Germany     3596999                2022   52.5200     13.405
1  Hamburg  Germany     1964021                2023   53.5500     10.000
2   Munich  Germany     1510378                2023   48.1375     11.575

In [27]:
cities_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City                 3 non-null      object
 1   Country              3 non-null      object
 2   Population           3 non-null      int64
 3   Year_Data_Retrieved  3 non-null      object
 4   Latitude             3 non-null      float64
 5   Longitude            3 non-null      float64
dtypes: float64(2), int64(1), object(3)
memory usage: 276.0+ bytes

In [ ]:
# cities_df.to_csv('cities_df.csv')

## 2 Create two tbles from the "cities_df"

Remember we want to have a relational database!!!

In [28]:
# Create the "cities df" for the relational data base

cities_to_db = cities_df[["City", "Country", "Latitude", "Longitude"]]
cities_to_db

      City  Country  Latitude  Longitude
0   Berlin  Germany   52.5200     13.405
1  Hamburg  Germany   53.5500     10.000
2   Munich  Germany   48.1375     11.575

In [29]:
cities_to_db.rename(columns={"City": "City_name"}, inplace=True)
cities_to_db

/var/folders/cn/bdqc214d4dqcr16tz7kb403w0000gn/T/ipykernel_2963/3945587001.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cities_to_db.rename(columns={"City": "City_name"}, inplace=True)

  City_name  Country  Latitude  Longitude
0    Berlin  Germany   52.5200     13.405
1   Hamburg  Germany   53.5500     10.000
2    Munich  Germany   48.1375     11.575

In [30]:
# Create the "population df" for the relational data base

population_to_db = cities_df[["Population", "Year_Data_Retrieved"]]
population_to_db

   Population Year_Data_Retrieved
0     3596999                2022
1     1964021                2023
2     1510378                2023

## 3 Creating the database and the backbone of cities & population tables

Before we can send the information in SQL, we need to make tables that have the same columns and data types to recieve the data. While we are creating a table for cities, we can also create the population table too.

Open MySQL Workbench, open a local connection, and open a new file. Then copy and paste the code from below.

```sql
-- Drop the database if it already exists
-- DROP DATABASE IF EXISTS gans_local;


-- Create the database
CREATE DATABASE gans_local;

-- Use the database
USE gans_local;


CREATE TABLE cities (
    City_id INT AUTO_INCREMENT, -- Automatically generated ID for each city
    City_name VARCHAR(255) NOT NULL, -- Name of the city
    Country VARCHAR(255) NOT NULL, -- Name of the country
    PRIMARY KEY (City_id) -- Primary key to uniquely identify each city
);


CREATE TABLE population (
    Population_id INT AUTO_INCREMENT,
    Population INT NOT NULL,
    Year_Data_Retrieved VARCHAR(255),
    City_id INT,
    PRIMARY KEY (Population_id),
    FOREIGN KEY (City_id) REFERENCES cities(City_id)
);
```

## 4 Push the "cities_to_db" to the empty "cities" table in the database

In [12]:
#from secret import MySQL_pass

In [ ]:
# Establishment of connection with the SQL database

schema = "gans" # The name of your database
host = "127.0.0.1"
user = "root"
password = "ENTER PASSWORD HERE"
port = 3306

connection_string = f'mysql+pymysql://{user}:{password}@{host}:{port}/{schema}'

In [32]:
# Push the "cities_to_db" to the empty "cities" table in the MySQL data base

cities_to_db.to_sql('cities',
                  if_exists='append',
                  con=connection_string,
                  index=False)

3

## 5 Read the "cities" table from the database into the notebook

This step is needed to fetch the "city_id" column and integrate it into the "population_to_db" dataframe. The "city_id" column in "population_to_db" dataframe will serve as a foreign key in order to establish a relation between both "cities" & "population" tables

In [33]:
cities_from_sql = pd.read_sql("cities", con=connection_string)
cities_from_sql

   city_id city_name  country  longitude  latitude
0        1    Berlin  Germany     13.405   52.5200
1        2   Hamburg  Germany     10.000   53.5500
2        3    Munich  Germany     11.575   48.1375

In [35]:
# Getting the "City_id" to the population df

population_to_db["city_id"] = cities_from_sql["city_id"]
population_to_db

/var/folders/cn/bdqc214d4dqcr16tz7kb403w0000gn/T/ipykernel_2963/354291773.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  population_to_db["city_id"] = cities_from_sql["city_id"]

   Population Year_Data_Retrieved  city_id
0     3596999                2022        1
1     1964021                2023        2
2     1510378                2023        3

In [36]:
population_to_db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Population           3 non-null      int64
 1   Year_Data_Retrieved  3 non-null      object
 2   city_id              3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

## 6 Push the "population_to_db" to the empty "population" table in the database

In [37]:
# Push the "population_to_db" to the empty "population" table in the MySQL data base

population_to_db.to_sql('population',
                  if_exists='append',
                  con=connection_string,
                  index=False)

3